#include <iostream>
#include <cstdlib>
#include <string>
#include <ctime>
#include <iomanip>

using namespace std;

class meat {
private:
    string food[8] = { "삼겹살","목살","갈매기살","항정살","가브리살","갈비","등심","안심" };
    string name[8][3] = {
        { "신육간","고기랑한방울","돼지집딸" },
        { "신육간","고기랑한방울","돼지집딸" },
        { "지대루 참숯왕소금구이","선진축산","칼집삼겹" },
        { "지대루 참숯왕소금구이","선진축산","칼집삼겹" },
        { "지대루 참숯왕소금구이","선진축산","칼집삼겹" },
        {"통큰집","맵당","홍보석 숯불구이"},
        {"황소야","시어링앤스터프","조선화로집"},
        {"황소야","시어링앤스터프","조선화로집"}
    };
    string num[8][3] = {
        {"051-515-6668","051-516-8474","051-512-5550"},
        {"051-515-6668","051-516-8474","051-512-5550"},
        {"051-583-3005","0507-1383-3637","051-513-9392"},
        {"051-583-3005","0507-1383-3637","051-513-9392"},
        {"051-583-3005","0507-1383-3637","051-513-9392"},
        {"051-512-2331","051-515-3373","051-581-0950"},
        {"051-515-2152","0507-1320-6227","051-583-9194"},
        {"051-515-2152","0507-1320-6227","051-583-9194"}
    };
    string address[8][3] = {
        {"금정구 금정로91번길 20","금정구 금강로 274-3","금정구 부산대학로50번길 26" },
        {"금정구 금정로91번길 20","금정구 금강로 274-3","금정구 부산대학로50번길 26" },
        {"금정구 식물원로 28","금정구 금강로 278 2층","금정구 금정로91번길 3" },
        {"금정구 식물원로 28","금정구 금강로 278 2층","금정구 금정로91번길 3" },
        {"금정구 식물원로 28","금정구 금강로 278 2층","금정구 금정로91번길 3" },
        {"금정구 금정로60번길 7-3","금정구 금강로 269","금정구 금강로 256-7"},
        {"금정구 부산대학로49번길 32","금정구 부산대학로49번길 52","금정구 식물원로 25" },
        {"금정구 부산대학로49번길 32","금정구 부산대학로49번길 52","금정구 식물원로 25"}
    };
public:
    int i;

    void ShowRandom() {
        i = rand() % 8;
        cout << food[i] << endl;
    }

    void ShowName() {
        cout << left << setw(40) << name[i][0] << setw(40) << name[i][1] << setw(40) << name[i][2] << "\n";
    }

    void ShowNumber() {
        cout << left << setw(40) << num[i][0] << setw(40) << num[i][1] << setw(40) << num[i][2] << "\n";
    }

    void ShowAddress() {
        cout << left << setw(40) << address[i][0] << setw(40) << address[i][1] << setw(40) << address[i][2] << "\n";
    }
};

class desert {
private:
    string food[6] = { "떡볶이&순대","빙수","보쌈","푸딩","빵","케이크"};
    string name[6][3] = {
        {"죠스떡볶이","엽기떡볶이","신전떡볶이"},
        {"서빙고", "설빙","카카오두"},
        {"싸움의 고수","명가왕족","명주네보쌈"},
        {"all about banana","sweater bakeshop","카페호밀"},
        {"sweater bakeshop","이흥용과자점","파나카B"},
        {"sweater bakeshop","이흥용과자점","파나카B"}
    };
    string num[6][3] = {
        {"051-581-1077","051-4109-8635","051-517-3451"},
        {"070-4195-5345","051-583-0117","0507-1336-9702"},
        {"051-583-9577","0507-1345-6818","051-512-2093"},
        {"051-512-8899","051-515-9712","0507-1337-0234"},
        {"051-515-9712","051-711-4454","070-7375-7867"},
        {"051-515-9712","051-711-4454","070-7375-7867"}
    };
    string address[6][3] = {
        {"금정구 금강로 260","금정구 금강로 271-4","금정구 금강로 272-1"},
        {"금정구 장전로12번길 9","금정구 금강로 260-1","금정구 금강로 277"},
        {"금정구 금강로 248-9","금정구 부산대학로49번길 41","금정구 금정로119번길 16"},
        {"금정구 금정로68번길 35","금정구 장전로20번길 23","금정구 금샘로 34"},
        {"금정구 장전로20번길 23","금정구 부산대학로63번길 30","금정구 금정로 94"},
        {"금정구 장전로20번길 23","금정구 부산대학로63번길 30","금정구 금정로 94"}
    };
public:
    int i;

    void ShowRandom() {
        i = rand() % 6;
        cout << food[i] << endl;
    }

    void ShowName() {
        cout << left << setw(40) << name[i][0] << setw(40) << name[i][1] << setw(40) << name[i][2] << "\n";
    }

    void ShowNumber() {
        cout << left << setw(40) << num[i][0] << setw(40) << num[i][1] << setw(40) << num[i][2] << "\n";
    }

    void ShowAddress() {
        cout << left << setw(40) << address[i][0] << setw(40) << address[i][1] << setw(40) << address[i][2] << "\n";
    }
};

int main()
{
    int k;
    srand((unsigned int)time(NULL)); //시드값 설정해주기.

    cout << "메뉴선택프로그램" << endl;
    cout << "1.고기 2.분식/디저트" << endl;
    cin >> k;



    switch (k) {

    case 1:
    {
        cout << "고기가 선택됐습니다." << endl;
        meat met;
        met.ShowRandom();
        met.ShowName();
        met.ShowNumber();
        met.ShowAddress();
        break;
    }

    case 2:
    {
        cout << "분식/디저트가 선택됐습니다." << endl;
        desert des;
        des.ShowRandom();
        des.ShowName();
        des.ShowNumber();
        des.ShowAddress();
        break;
    }

    }

    return 0;
};